---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.Notes
source: html/f9345f9b-73e4-0816-3bfb-b2db239daf03.htm
---
# Autodesk.Revit.DB.FabricationPart.Notes Property

The notes of the fabrication part.

## Syntax (C#)
```csharp
public string Notes { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: